# 11.	Умната Лили
# Лили вече е на N години. За всеки свой рожден ден тя получава подарък.
# За нечетните рождени дни (1, 3, 5...n) получава играчки, а за всеки четен (2, 4, 6...n) получава пари.
# За втория рожден ден получава 10.00 лв, като сумата се увеличава с 10.00 лв., за всеки следващ четен рожден ден
# (2 -> 10, 4 -> 20, 6 -> 30...и т.н.). През годините Лили тайно е спестявала парите. Братът на Лили, в годините, които
# тя получава пари, взима по 1.00 лев от тях. Лили продала играчките получени през годините, всяка за P лева и добавила
# сумата към спестените пари. С парите искала да си купи пералня за X лева. Напишете програма, която да пресмята, колко
# пари е събрала и дали ѝ стигат да си купи пералня.

N = int(input())
price_washing_machine = float(input())
price_toy = float(input())
count_toy = 0
birthday_money = 0

for i in range(1, N + 1, 2):
    count_toy += 1

for i in range(2, N + 1, 2):
    birthday_money += 10 * i / 2 - 1

toys_money = count_toy * price_toy

money = birthday_money + toys_money

if money >= price_washing_machine:
    print(f'Yes! {abs(money - price_washing_machine):.2f}')
else:
    print(f'No! {abs(money - price_washing_machine):.2f}')





