# 6.	* Благотворителна кампания
# В сладкарница се провежда благотворителна кампания за събиране на средства, в която могат да се включат сладкари от цялата страна.
# Първоначално прочитаме от конзолата броя на дните, в които тече кампанията и броя на сладкарите, които ще се включат.
# След това на отделни редове получаваме количеството на тортите, гофретите и палачинките, които ще бъдат приготвени от един сладкар за един ден.
# Трябва да се има предвид следния ценоразпис:
# •	Торта - 45 лв.
# •	Гофрета - 5.80 лв.
# •	Палачинка – 3.20 лв.
# 1/8 от крайната сума ще бъде използвана за покриване на разходите за продуктите по време на кампанията.
# Да се напише програма, която изчислява сумата, която е събрана в края на кампанията.

count_days = int(input())
count_baker = int(input())
count_cakes = int(input())
count_waffles = int(input())
count_pancakes = int(input())

price_cake = 45
price_waffle = 5.80
price_pancake = 3.20

sum = count_days * count_baker * (count_cakes * price_cake + count_pancakes * price_pancake + count_waffles * price_waffle) * (1 - 1 / 8)
print(sum)