# 7.	Боядисване на къща
# Напишете програма, която да пресмята колко литра боя е нужна за боядисването на къщa. Като за стените се използва зелена боя, а за покрива – червена.
# Разхода на зелената боя е 1 литър за 3.4 м2, а на червената – 1 литър за 4.3 м2.
# Стените имат следните размери:
# •	Предната и задната стена са квадрати със страна „x“
# o	на предната стена има правоъгълна врата с широчина 1.2м и височина 2м
# •	Страничните стени са правоъгълници със страни „x“ и „y“
# o	и на двете странични стени има по един квадратен прозорец със страна 1.5м
# Покривът има следните размери:
# •	Два правоъгълника със страни „x“ и „y“
# •	Два равностранни триъгълника със страна „x“ и височина „h“
# Трябва да пресметнете площта на всички страни и площта на покрива, за да
# намерите колко литра от всяка боя ще са нужни

x = float(input())
y = float(input())
h = float(input())

l_per_m2_green = 1 / 3.4
l_per_m2_red = 1 / 4.3

m2_green_wall_front = x * x - 1.2 * 2
m2_green_wall_back = x * x
m2_green_wall_side = x * y - 1.5 * 1.5

m2_red_roof_triangle = x * h / 2
m2_red_roof_rectangle = x * y

m2_green_total = m2_green_wall_front + m2_green_wall_back + 2 * m2_green_wall_side
m2_red_total = 2 * (m2_red_roof_rectangle + m2_red_roof_triangle)

l_green_total = m2_green_total * l_per_m2_green
l_red_total = m2_red_total * l_per_m2_red

print(f'{l_green_total:.2f}')
print(f'{l_red_total:.2f}')