# ремонт на плочки
# На площадката пред жилищен блок трябва да се поставят плочки. Площадката е с форма на квадрат със страна N метра. Плочките са широки „W“ метра и дълги „L“ метра.
# На площадката има една пейка с ширина M метра и дължина O метра. Под нея не е нужно да се слагат плочки. Всяка плочка се поставя за 0.2 минути.
# Напишете програма, която чете от конзолата размерите на площадката, плочките и пейката и пресмята колко плочки са необходими да се покрие площадката и
# пресмята времето за поставяне на всички плочки.
#
# Пример: площадка с размер 20 м. има площ 400 кв.м.. Пейка, широка 1 м. и дълга 2 м., заема площ 2 кв.м. Една плочка е широка 5 м. и дълга 4 м. и има площ = 20 кв.м.
# Площта, която трябва да се покрие, е 400 – 2 = 398 кв.м. Необходими са 398 / 20 = 19.90 плочки. Необходимото време е 19.90 * 0.2 = 3.98 минути.

N = float(input())
W = float(input())
L = float(input())
M = float(input())
O = float(input())

area_square = N ** 2
area_bench = M * O
area_to_cover = area_square - area_bench

area_tile = W * L

tiles_count = area_to_cover / area_tile

time_in_min = tiles_count * 0.2

print(round(tiles_count, 2))
print(round(time_in_min, 2))

