# 8.	* Аквариум
# За рождения си ден Любомир получил аквариум с формата на паралелепипед.
# Трябва да се пресметне колко литра вода ще събира аквариума, ако се знае, че определен процент от вместимостта му е заета от пясък, растения, нагревател и помпа.
# Размерите му – дължина, широчина и височина в сантиметри ще бъдат въведени от конзолата.
# Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм3/.
# Да се напише програма, която изчислява литрите вода, която са необходими за напълването на аквариума.

a = int(input())
b = int(input())
h = int(input())
other_volume_percentage = float(input()) / 100

volume_total = (a * 0.1) * (b * 0.1) * (h * 0.1)
volume_water = (1 - other_volume_percentage) * volume_total
print(volume_water)
