# 6.	Рибна борса
# Георги ще има гости вечерта и решава да ги нагости с паламуд, сафрид и миди.
# Затова отива на рибната борса, за да си купи по няколко килограма.
# Oт конзолата се въвеждат цените в лева на скумрията и цацата.
# Също количеството на паламуд, сафрид и миди в килограми. Колко пари ще са му необходими, за да плати сметката си, ако цените на борсата са:
# •	Паламуд – 60% по-скъп от скумрията
# •	Сафрид – 80% по-скъп от цацата
# •	Миди – 7.50 лв. за килограм

price_sk = float(input())
price_c = float(input())
kg_p = float(input())
kg_sa = float(input())
kg_m = int(input())

price_p = 1.6 * price_sk
price_sa = 1.8 * price_c
price_m = 7.5

sum = kg_p * price_p + kg_sa * price_sa + kg_m * price_m

print(f'{sum:.2f}')
