# бонус точки
# Дадено е цяло число – брой точки. Върху него се начисляват бонус точки по правилата, описани по-долу.
# Да се напише програма, която пресмята бонус точките за това число и общия брой точки с бонусите.
#
# Ако числото е до 100 включително, бонус точките са 5.
# Ако числото е по-голямо от 100, бонус точките са 20% от числото.
# Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
# Допълнителни бонус точки (начисляват се отделно от предходните):
# За четно число -> + 1 т.
# За число, което завършва на 5 -> + 2 т.
#

points = int(input())

if points <= 100:
    bonus = 5
elif 100 < points <= 1000:
    bonus = points * 0.2
elif points > 1000:
    bonus = points * 0.1

if points % 2 == 0:
    bonus = bonus + 1
elif points % 5 == 0 and points % 2 == 1:
    bonus = bonus + 2

points_total = points + bonus

print(bonus)
print(points_total)


