# четно или нечетно
# Да се напише програма, която проверява, дали дадено цяло число е четно (even) или нечетно (odd).
#
# Задачата можем да решим с помощта на една if-else конструкция и оператора %, който връща остатък при деление на две числа:

number = int(input())

if number % 2 == 0:
    print("even")
else:
    print("odd")