# лица на фигури
# Да се напише програма, която въвежда размерите на геометрична фигура и пресмята лицето й.
# Фигурите са четири вида: квадрат (square), правоъгълник (rectangle), кръг (circle) и триъгълник (triangle).
#
# На първия ред на входа се чете вида на фигурата (square, rectangle, circle, triangle):
#
# Ако фигурата е квадрат, на следващия ред се чете едно число – дължина на страната му.
# Ако фигурата е правоъгълник, на следващите два реда се четат две числа – дължините на страните му.
# Ако фигурата е кръг, на следващия ред се чете едно число – радиусa на кръга.
# Ако фигурата е триъгълник, на следващите два реда се четат две числа – дължината на страната му и дължината на височината към нея.
# Резултатът да се закръгли до 3 цифри след десетичния знак.

from math import pi

shape = input()

if shape == 'square':
    a = float(input())
    area = a * a
elif shape == 'rectangle':
    a = float(input())
    b = float(input())
    area = a * b
elif shape == 'circle':
    r = float(input())
    area = pi * r ** 2
elif shape == 'triangle':
    a = float(input())
    h = float(input())
    area = a * h / 2

print(f'{area:.3f}')