# 4.	Лодка за риболов
# Тони и приятели много обичат да ходят за риба и са толкова запалени по риболова, че решават да отидат на риболов с кораб.
# Цената за наема на кораба зависи от сезона и броя рибари:
# В зависимост от сезона:
# •	Цената за наем на кораба през пролетта е  3000 лв.;
# •	Цената за наем на кораба през лятото и есента е  4200 лв.;
# •	Цената за наем на кораба през зимата е  2600 лв.
# В зависимост от броя на групата има различна отстъпка:
# •	Ако групата е до 6 човека включително  –  отстъпка от 10%;
# •	Ако групата е от 7 до 11 човека включително  –  отстъпка от 15%;
# •	Ако групата е от 12 нагоре  –  отстъпка от 25%.
# Рибарите ползват допълнително 5% отстъпка, ако са четен брой, освен ако не е есен - тогава нямат допълнителна отстъпка,
# която се начислява след като се приспадне отстъпката по горните критерии.
# Напишете програма, която да пресмята дали рибарите ще съберат достатъчно пари.

money_available = int(input())
season = input()
count_fisherman = int(input())

if season == 'Spring':
    price = 3000
elif season == 'Summer' or season == 'Autumn':
    price = 4200
elif season == 'Winter':
    price = 2600

if count_fisherman <= 6:
    price = 0.9 * price
elif 7 <= count_fisherman <= 11:
    price = 0.85 * price
else:
    price = 0.75 * price

if count_fisherman % 2 == 0 and season != 'Autumn':
    price = 0.95 * price

if price <= money_available:
    print(f'Yes! You have {abs(price - money_available):.2f} leva left.')
else:
    print(f'Not enough money! You need {abs(price - money_available):.2f} leva.')