# 6.	Шофьор на ТИР
# Напишете програма която пресмята колко пари ще изкара шофьор на ТИР за един сезон.
# На входа програмата получава през кой сезон ще работи шофьора, както и колко километра на месец ще кара.
# Един сезон е 4 месеца. Според зависи сезона и броя километри на месец ще му се заплаща различна сума на километър:
#
#                                     Пролет/Есен	        Лято	        Зима
# км на месец <= 5000	                0.75 лв./км	        0.90 лв./км	    1.05 лв./км
# 5000 < км на месец <= 10000	        0.95 лв./км	        1.10 лв./км	    1.25 лв./км
# 10000 < км на месец <= 20000	    1.45 лв./км – за който и да е сезон
#
# След като са извадени 10% за данъци се отпечатват останалите пари.

