# 11.	Паркинг "Happy Cat"
# Деси трябва да заведе котката си на ветеринар в клиниката "Happy Cat", но паркингът се заплаща.
# Напишете програма, която пресмята колко общо трябва да се плати за престоя на колата на Деси на паркинга,
# за да заведе котката си на ветеринар. Паркингът е различен от останалите и има разнообразен ценоразпис.
# За всеки четен ден и нечетен час, паркингът таксува 2.50 лева. Във всеки нечетен ден и четен час таксата е 1.25 лева,
# във всички останали случаи се заплаща 1 лев. Таксуването става на всеки изминал час от деня. Всеки един от изходите
# трябва да бъде закръглен до втория знак след десетичната запетая.

