# магически числа
# Да се напише програма, която въвежда едно цяло магическо число и изкарва всички възможни 6-цифрени числа, за
# които произведението на техните цифри е равно на магическото число.
#
# Пример: "Магическо число" → 2
#
# 111112 → 1 * 1 * 1 * 1 * 1 * 2 = 2
# 111121 → 1 * 1 * 1 * 1 * 2 * 1 = 2
# 111211 → 1 * 1 * 1 * 2 * 1 * 1 = 2
# 112111 → 1 * 1 * 2 * 1 * 1 * 1 = 2
# 121111 → 1 * 2 * 1 * 1 * 1 * 1 = 2
# 211111 → 2 * 1 * 1 * 1 * 1 * 1 = 2

n = int(input())
divisor = 2

while divisor <= n:
    if n % divisor == 0:
        denominator = divisor
        n = n / denominator
        print(denominator)
    divisor += 1
