# За по-добро разбиране, нека стъпка по стъпка да напишем програма, която трябва да направи всички възможни комбинации
# от двойки числа. Първото число от комбинацията е нарастващо от 1 до 3, а второто е намаляващо от 3 до 1.
# Задачата трябва да продължи изпълнението си, докато i + j не е равно на 2 (т.е. i = 1 и j = 1).

has_to_end = False

for i in range(1, 4):
    if has_to_end == False:
        for j in range(3, 0, -1):
            if i + j == 2:
                has_to_end = True
                break
            print(f'{i} {j}')