# оператор break в безкраен цикъл
# Да се напише програма, която проверява дали едно число n е четно, ако е - да се отпечатва на екрана.
# За четно считаме число, което се дели на 2 без остатък. При невалидно число да се връща към повторно
# въвеждане и да се изписва съобщение, което известява, че въведеното число не е четно.

while True:
    try:
        print('Enter even number:', end=' ')
        n = int(input())
        if n % 2 == 0:
            break
        print('The number is not even.')
    except ValueError:
        print('Invalid number.')

print(n)