# редица числа 2k+1
# Да се напише програма, която отпечатва всички числа ≤ n от редицата: 1, 3, 7, 15, 31, …,
# като приемем, че всяко следващо число = предишно число * 2 + 1.
#
# Ето как можем да решим задачата:
#
# Създаваме променлива num за текущото число, на която присвояваме начална стойност 1.
# За условие на цикъла слагаме текущото число <= n.
# В тялото на цикъла: отпечатваме стойността на текущото число и увеличаваме текущото число,
# използвайки формулата от условието на задачата.

n = int(input())
current_number = 1

while current_number <= n:
    print(current_number)
    current_number = current_number * 2 + 1





