# 5.	Деление без остатък
# Дадени са n-на брой цели числа в интервала [1…1000]. От тях някакъв процент p1 се делят без остатък на 2,
# друг процент p2 се делят без остатък на 3, друг процент p3 се делят без остатък на 4. Да се напише програма,
# която изчислява и отпечатва процентите p1, p2 и p3.
# Пример: имаме n = 10 числа: 680, 2, 600, 200, 800, 799, 199, 46, 128, 65.

n = int(input())
count_p1 = 0
count_p2 = 0
count_p3 = 0

for i in range(1, n + 1):
    current_number = int(input())
    if current_number % 2 == 0:
        count_p1 += 1
    if current_number % 3 == 0:
        count_p2 += 1
    if current_number % 4 == 0:
        count_p3 += 1

p1 = (count_p1 / n) * 100
p2 = (count_p2 / n) * 100
p3 = (count_p3 / n) * 100

print(f'{p1:.2f}%')
print(f'{p2:.2f}%')
print(f'{p3:.2f}%')